CSI API ETABS v1
cCaseStaticNonlinearStaged.SetHingeUnloading Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetHingeUnloading(
	string Name,
	int UnloadType
)
Function SetHingeUnloading (
	Name As String,
	UnloadType As Integer
) As Integer
Dim instance As cCaseStaticNonlinearStaged
Dim Name As String
Dim UnloadType As Integer
Dim returnValue As Integer
returnValue = instance.SetHingeUnloading(Name,
	UnloadType)
int SetHingeUnloading(
	String^ Name,
	int UnloadType
)
abstract SetHingeUnloading :
        Name : string *
        UnloadType : int -> int
Parameters
Name
Type: System.String
UnloadType
Type: System.Int32
Return Value
Type: Int32
See Also
Reference
cCaseStaticNonlinearStaged Interface
ETABSv1 Namespace